const data = [
    { Date: '00:00', name: ' 全部应用', 点击量: 5200 },
    { Date: '1:00', name: ' 全部应用', 点击量: 5560 },
    { Date: '2:00', name: ' 全部应用', 点击量: 5868 },
    { Date: '3:00', name: ' 全部应用', 点击量: 5898 },
    { Date: '4:00', name: ' 全部应用', 点击量: 6248 },
    { Date: '5:00', name: ' 全部应用', 点击量: 7586 },
    { Date: '6:00', name: ' 全部应用', 点击量: 8033 },
    { Date: '7:00', name: ' 全部应用', 点击量: 12000 },
    { Date: '8:00', name: ' 全部应用', 点击量: 12040 },
    { Date: '9:00', name: ' 全部应用', 点击量: 12580 },
    { Date: '10:00', name: ' 全部应用', 点击量: 12862 },
    { Date: '11:00', name: ' 全部应用', 点击量: 13354 },
    { Date: '12:00', name: ' 全部应用', 点击量: 14153 },
    { Date: '13:00', name: ' 全部应用', 点击量: 14403 },
    { Date: '14:00', name: ' 全部应用', 点击量: 14800 },
    { Date: '15:00', name: ' 全部应用', 点击量: 15200 },
    { Date: '16:00', name: ' 全部应用', 点击量: 15600 },
    { Date: '17:00', name: ' 全部应用', 点击量: 16200 },
    { Date: '18:00', name: ' 全部应用', 点击量: 16600 },
    { Date: '19:00', name: ' 全部应用', 点击量: 17000 },
    { Date: '20:00', name: ' 全部应用', 点击量: 17600 },
    { Date: '21:00', name: ' 全部应用', 点击量: 18400 },
    { Date: '22:00', name: ' 全部应用', 点击量: 18900 },
    { Date: '23:00', name: ' 全部应用', 点击量: 19600 },

    { Date: '00:00', name: ' 易批注', 点击量: 4800 },
    { Date: '1:00', name: ' 易批注', 点击量: 4200 },
    { Date: '2:00', name: ' 易批注', 点击量: 5680 },
    { Date: '3:00', name: ' 易批注', 点击量: 968 },
    { Date: '4:00', name: ' 易批注', 点击量: 1017 },
    { Date: '5:00', name: ' 易批注', 点击量: 817 },
    { Date: '6:00', name: ' 易批注', 点击量: 869 },
    { Date: '7:00', name: ' 易批注', 点击量: 1569 },
    { Date: '8:00', name: ' 易批注', 点击量: 1485 },
    { Date: '9:00', name: ' 易批注', 点击量: 2054 },
    { Date: '10:00', name: ' 易批注', 点击量: 3045 },
    { Date: '11:00', name: ' 易批注', 点击量: 3553 },
    { Date: '12:00', name: ' 易批注', 点击量: 2150 },
    { Date: '13:00', name: ' 易批注', 点击量: 3540 },
    { Date: '14:00', name: ' 易批注', 点击量: 1480 },
    { Date: '15:00', name: ' 易批注', 点击量: 4450 },
    { Date: '16:00', name: ' 易批注', 点击量: 4080 },
    { Date: '17:00', name: ' 易批注', 点击量: 5250 },
    { Date: '18:00', name: ' 易批注', 点击量: 1052 },
    { Date: '19:00', name: ' 易批注', 点击量: 1587 },
    { Date: '20:00', name: ' 易批注', 点击量: 2540 },
    { Date: '21:00', name: ' 易批注', 点击量: 1208 },
    { Date: '22:00', name: ' 易批注', 点击量: 1202 },
    { Date: '23:00', name: ' 易批注', 点击量: 865 },
 
    { Date: '00:00', name: ' 校审云授权', 点击量: 92 },
    { Date: '1:00', name: ' 校审云授权', 点击量: 88 },
    { Date: '2:00', name: ' 校审云授权', 点击量: 69 },
    { Date: '3:00', name: ' 校审云授权', 点击量: 78 },
    { Date: '4:00', name: ' 校审云授权', 点击量: 58 },
    { Date: '5:00', name: ' 校审云授权', 点击量: 45 },
    { Date: '6:00', name: ' 校审云授权', 点击量: 252 },
    { Date: '7:00', name: ' 校审云授权', 点击量: 1569 },
    { Date: '8:00', name: ' 校审云授权', 点击量: 1245 },
    { Date: '9:00', name: ' 校审云授权', 点击量: 2354 },
    { Date: '10:00', name: ' 校审云授权', 点击量: 2600 },
    { Date: '11:00', name: ' 校审云授权', 点击量: 2400 },
    { Date: '12:00', name: ' 校审云授权', 点击量: 2000 },
    { Date: '13:00', name: ' 校审云授权', 点击量: 1800 },
    { Date: '14:00', name: ' 校审云授权', 点击量: 1500 },
    { Date: '15:00', name: ' 校审云授权', 点击量: 600 },
    { Date: '16:00', name: ' 校审云授权', 点击量: 835 },
    { Date: '17:00', name: ' 校审云授权', 点击量: 545 },
    { Date: '18:00', name: ' 校审云授权', 点击量: 545 },
    { Date: '19:00', name: ' 校审云授权', 点击量: 253 },
    { Date: '20:00', name: ' 校审云授权', 点击量: 100 },
    { Date: '21:00', name: ' 校审云授权', 点击量: 124 },
    { Date: '22:00', name: ' 校审云授权', 点击量: 110 },
    { Date: '23:00', name: ' 校审云授权', 点击量: 120 },
  ];



  const linePlot = new G2Plot.Line('index_user_line1-day', {
    data,
    xField: 'Date',
    yField: '点击量',
    seriesField: 'name',
    yAxis: {
      label: {
        // formatter: (v) => `${(v / 10e8).toFixed(1)} 亿次`,
      },
    },
    legend: {
      position: 'top',
    },
    point :{
      shape: 'circle'
    },
    smooth: true,
    // 配置折线趋势填充
    // area: {
    //   style: {
    //     fillOpacity: 0.15,
    //   },
    // },
    // animation: {
    //   appear: {
    //     animation: 'wave-in',
    //     duration: 3000,
    //   },
    // },
  });

  linePlot.render();






