const data5 = [
  { Date: '2022/5/1', name: ' 全部应用', 点击量: 3265 },
  { Date: '2022/5/2', name: ' 全部应用', 点击量: 3265 },
  { Date: '2022/5/3', name: ' 全部应用', 点击量: 3265 },
  { Date: '2022/5/4', name: ' 全部应用', 点击量: 3965 },
  { Date: '2022/5/5', name: ' 全部应用', 点击量: 4317 },
  { Date: '2022/5/6', name: ' 全部应用', 点击量: 4717 },
  { Date: '2022/5/7', name: ' 全部应用', 点击量: 5717 },
  { Date: '2022/5/8', name: ' 全部应用', 点击量: 6569 },
  { Date: '2022/5/9', name: ' 全部应用', 点击量: 7769 },
  { Date: '2022/5/10', name: ' 全部应用', 点击量: 9485 },
  { Date: '2022/5/11', name: ' 全部应用', 点击量: 10254 },
  { Date: '2022/5/12', name: ' 全部应用', 点击量: 12545 },
  { Date: '2022/5/13', name: ' 全部应用', 点击量: 14653 },
  { Date: '2022/5/14', name: ' 全部应用', 点击量: 16453 },
  { Date: '2022/5/15', name: ' 全部应用', 点击量: 17003 },
  { Date: '2022/5/16', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/17', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/18', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/19', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/20', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/21', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/22', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/23', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/24', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/25', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/26', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/27', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/28', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/29', name: ' 全部应用', 点击量: 18000 },
  { Date: '2022/5/30', name: ' 全部应用', 点击量: 18000 },

  { Date: '2022/5/1', name: ' 易批注', 点击量: 1800 },
  { Date: '2022/5/2', name: ' 易批注', 点击量: 1800 },
  { Date: '2022/5/3', name: ' 易批注', 点击量: 1800 },
  { Date: '2022/5/4', name: ' 易批注', 点击量: 2546 },
  { Date: '2022/5/5', name: ' 易批注', 点击量: 3566 },
  { Date: '2022/5/6', name: ' 易批注', 点击量: 3777 },
  { Date: '2022/5/7', name: ' 易批注', 点击量: 4569 },
  { Date: '2022/5/8', name: ' 易批注', 点击量: 5236 },
  { Date: '2022/5/9', name: ' 易批注', 点击量: 6233 },
  { Date: '2022/5/10', name: ' 易批注', 点击量: 8055 },
  { Date: '2022/5/11', name: ' 易批注', 点击量: 9637 },
  { Date: '2022/5/12', name: ' 易批注', 点击量: 10222 },
  { Date: '2022/5/13', name: ' 易批注', 点击量: 13653 },
  { Date: '2022/5/14', name: ' 易批注', 点击量: 11653 },
  { Date: '2022/5/15', name: ' 易批注', 点击量: 15653 },
  { Date: '2022/5/16', name: ' 易批注', 点击量: 13653 },
  { Date: '2022/5/17', name: ' 易批注', 点击量: 17500 },
  { Date: '2022/5/18', name: ' 易批注', 点击量: 13300 },
  { Date: '2022/5/19', name: ' 易批注', 点击量: 15400 },
  { Date: '2022/5/20', name: ' 易批注', 点击量: 16800 },
  { Date: '2022/5/21', name: ' 易批注', 点击量: 14200 },
  { Date: '2022/5/22', name: ' 易批注', 点击量: 15600 },
  { Date: '2022/5/23', name: ' 易批注', 点击量: 14500 },
  { Date: '2022/5/24', name: ' 易批注', 点击量: 15800 },
  { Date: '2022/5/25', name: ' 易批注', 点击量: 16600 },
  { Date: '2022/5/26', name: ' 易批注', 点击量: 17100 },
  { Date: '2022/5/27', name: ' 易批注', 点击量: 16500 },
  { Date: '2022/5/28', name: ' 易批注', 点击量: 14500 },
  { Date: '2022/5/29', name: ' 易批注', 点击量: 13000 },
  { Date: '2022/5/30', name: ' 易批注', 点击量: 15000 },

  { Date: '2022/5/1', name: ' 校审云授权', 点击量: 524 },
  { Date: '2022/5/2', name: ' 校审云授权', 点击量: 524 },
  { Date: '2022/5/3', name: ' 校审云授权', 点击量: 524 },
  { Date: '2022/5/4', name: ' 校审云授权', 点击量: 700 },
  { Date: '2022/5/5', name: ' 校审云授权', 点击量: 352 },
  { Date: '2022/5/6', name: ' 校审云授权', 点击量: 400 },
  { Date: '2022/5/7', name: ' 校审云授权', 点击量: 1000 },
  { Date: '2022/5/8', name: ' 校审云授权', 点击量: 852 },
  { Date: '2022/5/9', name: ' 校审云授权', 点击量: 1200 },
  { Date: '2022/5/10', name: ' 校审云授权', 点击量: 1111 },
  { Date: '2022/5/11', name: ' 校审云授权', 点击量: 600 },
  { Date: '2022/5/12', name: ' 校审云授权', 点击量: 968 },
  { Date: '2022/5/13', name: ' 校审云授权', 点击量: 1500 },
  { Date: '2022/5/14', name: ' 校审云授权', 点击量: 5000 },
  { Date: '2022/5/15', name: ' 校审云授权', 点击量: 1600 },
  { Date: '2022/5/16', name: ' 校审云授权', 点击量: 2500 },
  { Date: '2022/5/17', name: ' 校审云授权', 点击量: 4500 },
  { Date: '2022/5/18', name: ' 校审云授权', 点击量: 5000 },
  { Date: '2022/5/19', name: ' 校审云授权', 点击量: 5200 },
  { Date: '2022/5/20', name: ' 校审云授权', 点击量: 4000 },
  { Date: '2022/5/21', name: ' 校审云授权', 点击量: 1500 },
  { Date: '2022/5/22', name: ' 校审云授权', 点击量: 3000 },
  { Date: '2022/5/23', name: ' 校审云授权', 点击量: 5000 },
  { Date: '2022/5/24', name: ' 校审云授权', 点击量: 2000 },
  { Date: '2022/5/25', name: ' 校审云授权', 点击量: 1000 },
  { Date: '2022/5/26', name: ' 校审云授权', 点击量: 2000 },
  { Date: '2022/5/27', name: ' 校审云授权', 点击量: 2000 },
  { Date: '2022/5/28', name: ' 校审云授权', 点击量: 4000 },
  { Date: '2022/5/29', name: ' 校审云授权', 点击量: 5000 },
  { Date: '2022/5/30', name: ' 校审云授权', 点击量: 5000 },
];


const linePlot5 = new G2Plot.Line('index_user_line1-auto', {
  data:data5,
  xField: 'Date',
  yField: '点击量',
  seriesField: 'name',
  yAxis: {
    label: {
      // formatter: (v) => `${(v / 10e8).toFixed(1)} 亿次`,
    },
  },
  legend: {
    position: 'top',
  },
  point :{
    shape: 'circle'
  },
  // smooth: true,
  // 配置折线趋势填充
  // area: {
  //   style: {
  //     fillOpacity: 0.15,
  //   },
  // },
  // animation: {
  //   appear: {
  //     animation: 'wave-in',
  //     duration: 3000,
  //   },
  // },
});

linePlot5.render();






